In [1]:
import numpy as np
import pandas as pd

In [2]:
rng = np.random.RandomState(42)
s1 = pd.Series(rng.rand(5))
s1

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [3]:
s1.sum()

2.811925491708157

In [4]:
sum(s1)

2.811925491708157

In [5]:
np.sum(s1)

2.811925491708157

In [6]:
df = pd.DataFrame({'A': rng.rand(5),
                   'B': rng.rand(5)})
df

          A         B
0  0.155995  0.020584
1  0.058084  0.969910
2  0.866176  0.832443
3  0.601115  0.212339
4  0.708073  0.181825

In [7]:
df.mean()

A    0.477888
B    0.443420
dtype: float64

In [8]:
df.mean(axis='columns')

0    0.088290
1    0.513997
2    0.849309
3    0.406727
4    0.444949
dtype: float64

In [9]:
df = pd.DataFrame({
    'key': list('ABCABC'),
    'data1': range(6),
    'data2': range(5, 11)
})
df

  key  data1  data2
0   A      0      5
1   B      1      6
2   C      2      7
3   A      3      8
4   B      4      9
5   C      5     10

In [10]:
df.groupby('key')

In [11]:
df.groupby('key').sum()

     data1  data2
key
A        3     13
B        5     15
C        7     17

In [13]:
df.groupby('key')['data1'].sum()
df.groupby('key')['data1'].mean()

key
A    1.5
B    2.5
C    3.5
Name: data1, dtype: float64

In [15]:
df.groupby('key').agg([sum, 'mean'])

    data1      data2
      sum mean   sum mean
key
A       3  1.5    13  6.5
B       5  2.5    15  7.5
C       7  3.5    17  8.5

In [16]:
df.groupby('key').agg({'data1': min, 'data2': max})

     data1  data2
key
A        0      8
B        1      9
C        2     10

In [19]:
df.groupby('key').transform(lambda x: x - x.mean())

   data1  data2
0   -1.5   -1.5
1   -1.5   -1.5
2   -1.5   -1.5
3    1.5    1.5
4    1.5    1.5
5    1.5    1.5

In [20]:
def norm_by_data2(x):
  x['data1'] /= x['data2'].sum()
  return x

df.groupby('key').apply(norm_by_data2)

  key     data1  data2
0   A  0.000000      5
1   B  0.066667      6
2   C  0.117647      7
3   A  0.230769      8
4   B  0.266667      9
5   C  0.294118     10

In [21]:
cars = pd.read_csv('https://vincentarelbundock.github.io/Rdatasets/csv/DAAG/toycars.csv', index_col=0)
cars.head()

   angle  distance  car
1    1.3      0.43    1
2    1.3      0.37    2
3    1.3      0.27    3
4    4.0      0.84    1
5    4.0      0.92    2

In [24]:
cars.groupby('angle')['distance'].agg(['mean', 'std'])

           mean       std
angle
0.9    0.266667  0.115036
1.1    0.296667  0.130128
1.3    0.356667  0.080829
2.2    0.606667  0.083267
2.7    0.590000  0.045826
3.1    0.640000  0.045826
3.6    0.750000  0.122882
4.0    0.816667  0.116762
4.9    1.083333  0.189297